app/views/restaurants/index.html.haml

- if Restaurant.all.any?
---
SELECT "restaurants".* FROM "restaurants"
SELECT COUNT(*) FROM "restaurants"