app/controllers/restaurants_controller.rb

	def create
		@restaurant = Restaurant.create_with_user(restaurant_params, current_user)
---
INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "KFC"], ["created_at", "2016-05-24 12:28:40.670615"], ["updated_at", "2016-05-24 12:28:40.670615"]]